
export const EIGHT_GUA = [
  { name: '乾', pcm: '111', element: '金', nature: '天', num: 1 },
  { name: '兑', pcm: '011', element: '金', nature: '泽', num: 2 },
  { name: '离', pcm: '101', element: '火', nature: '火', num: 3 },
  { name: '震', pcm: '001', element: '木', nature: '雷', num: 4 },
  { name: '巽', pcm: '110', element: '木', nature: '风', num: 5 },
  { name: '坎', pcm: '010', element: '水', nature: '水', num: 6 },
  { name: '艮', pcm: '100', element: '土', nature: '山', num: 7 },
  { name: '坤', pcm: '000', element: '土', nature: '地', num: 8 },
];

export const LIU_SHEN_INFO: Record<string, { icon: string, bg: string }> = {
  '青龙': { icon: '🐉', bg: 'bg-green-50' },
  '朱雀': { icon: '🕊️', bg: 'bg-red-50' },
  '勾陈': { icon: '🐾', bg: 'bg-yellow-50' },
  '腾蛇': { icon: '🐍', bg: 'bg-orange-50' },
  '白虎': { icon: '🐅', bg: 'bg-gray-100' },
  '玄武': { icon: '🐢', bg: 'bg-blue-50' }
};

export const GUA_PALACES: Record<string, string> = {
  '111111': '乾', '111110': '乾', '111100': '乾', '111000': '乾', '110000': '乾', '100000': '乾', '101000': '乾', '101111': '乾',
  '000000': '坤', '000001': '坤', '000011': '坤', '000111': '坤', '001111': '坤', '011111': '坤', '010111': '坤', '010000': '坤',
  '010010': '坎', '010011': '坎', '010001': '坎', '010101': '坎', '011101': '坎', '001101': '坎', '000101': '坎', '000010': '坎',
  '101101': '离', '101100': '离', '101110': '离', '101010': '离', '100010': '离', '110010': '离', '111010': '离', '111101': '离',
  '001001': '震', '001000': '震', '001010': '震', '001110': '震', '000110': '震', '010110': '震', '011110': '震', '011001': '震',
  '110110': '巽', '110111': '巽', '110101': '巽', '110001': '巽', '111001': '巽', '101001': '巽', '100001': '巽', '100110': '巽',
  '100100': '艮', '100101': '艮', '100111': '艮', '100011': '艮', '101011': '艮', '111011': '艮', '110011': '艮', '110100': '艮',
  '011011': '兑', '011010': '兑', '011000': '兑', '011100': '兑', '010100': '兑', '000100': '兑', '001100': '兑', '001011': '兑',
};

export const NA_JIA_MAP: Record<string, string[]> = {
  '乾': ['子水', '寅木', '辰土', '午火', '申金', '戌土'],
  '坎': ['寅木', '辰土', '午火', '申金', '戌土', '子水'],
  '艮': ['辰土', '午火', '申金', '戌土', '子水', '寅木'],
  '震': ['子水', '寅木', '辰土', '午火', '申金', '戌土'],
  '巽': ['丑土', '亥水', '酉金', '未土', '巳火', '卯木'],
  '离': ['卯木', '丑土', '亥水', '酉金', '未土', '巳火'],
  '坤': ['未土', '巳火', '卯木', '丑土', '亥水', '酉金'],
  '兑': ['巳火', '卯木', '丑土', '亥水', '酉金', '未土'],
};
